#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include<Windows.h>
#include<string.h>
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}

//void test()//空类型
//{
//	printf("hehe\n");
//}
//int main()
//{
//	test(100);
//	return 0;
//}

//int main()
//{
//	int a = 20;//00000000000000000000000000010100 -原码
//	           //00000000000000000000000000010100 -反码
//	           //00000000000000000000000000010100 -补码
//	           //0x00000014
//	int b = -10;//00000000000000000000000000001010 -原码
//	            //11111111111111111111111111110101 -反码
//	            //11111111111111111111111111110110 -补码
//	            //0xFFFFFFF6
//	return 0;
//}


//写一段代码告诉我们当前机器的字节序是多少

//int main()//优化前
//{
//	int a = 10;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//		printf("大端\n");
//	return 0;
//}

//int check_sys()//优化后
//{
//	int a = 1;
//	return (*(char*)&a);//返回1，小端    返回0，大端
//}
////指针类型的意义
////1.指针类型决定了指针解引用操作符能访问几个字节：char*p;*p 访问了1个字节，int*p,*p访问了4个字节
////2.指针类型决定了指针+1，-1加的或者减的是几个字节；char*p;p+1,跳过一个字符，int*p；p+1，跳过一个整形--4个字节
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//		printf("大端\n");
//}

//练习
//1.
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001  -原码
//	//11111111111111111111111111111110  -反码
//	//11111111111111111111111111111111  -补码
//	//11111111--char类型
//	//11111111111111111111111111111111  -转换为int后的补码
//	signed char b = -1;
//	//11111111--char
//	unsigned char c = -1;
//	//11111111--unsignchar--首位为有效位
//	//00000000000000000000000011111111  -整形提升后的补码
//	printf("a=%d,b=%d,c=%d\n", a, b, c);
//}

////2.
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000  -原码
//	//11111111111111111111111101111111  -反码
//	//11111111111111111111111110000000  -补码
//	//10000000 --char
//	//11111111111111111111111110000000 -整形提升-补码
//	print("%u\n", a);
//	return 0;
//}
////3.
//int main()
//{
//	char a = 128;//128=127+1==-128
//	print("%u\n", a);
//	return 0;
//}

////4
//int main()
//{
//	//按照补码的形式进行运算，最后格式化成为有符号的数
//	int i = -20;
//	//11111111 11111111 11111111 11101100 -补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010 -补码
//	//11111111 11111111 11111111 11110110 -补码
//	//11111111 11111111 11111111 11110101 -反码
//	//10000000 00000000 00000000 00001010 -原码 -10
//	printf("%d\n", i + j);
//	return 0;
//}

//5.死循环
//
//int main()
//{
//	unsigned int i;//unsigned int (0-255)
//	for (i = 9;i >= 0;i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

////6.
//int main()
//{
//	char a[1000];//char的范围(-128-127)
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//strlen遇到'\0'停止
//	return 0;
//}


//7.
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");//条件恒成立
	}
	return 0;
}                 